<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class InsertData extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('games')->insert([
            [
                'game_name' => 'Terraria',

                'game_detail' => 'ขุด! ต่อสู้! สำรวจ! สร้าง! เข้าร่วมชุมชน Terrarians นับล้าน!
                TERRARIA MOBILE สร้างใหม่ตั้งแต่ต้น - อัปเดต 1.4.4 ใหม่และปรับปรุงรวมถึงเนื้อหาเกี่ยวกับแรงงานแห่งความรัก!
                "นี่คือ Terraria เวอร์ชันเต็ม สร้างขึ้นจากพื้นฐาน... ถ้าคุณชอบมันบนพีซีหรือคอนโซล คุณจะหลงรักที่นี่" - เลื่อนเพื่อเล่น
                โลกทั้งใบอยู่ที่ปลายนิ้วของคุณเมื่อคุณต่อสู้เพื่อเอาชีวิตรอด โชคลาภ และเกียรติยศ เจาะลึกเข้าไปในโพรงกว้าง ค้นหาศัตรูที่ใหญ่กว่าเพื่อทดสอบความกล้าหาญของคุณในการต่อสู้ หรือสร้างเมืองของคุณเอง - ใน World of Terraria คุณเลือกได้!
                เราขอแนะนำ RAM อย่างน้อย 2GB และอุปกรณ์ตั้งแต่ปี 2014 หรือใหม่กว่า เรารองรับอุปกรณ์ที่ใช้ Android 5.0 ที่มี RAM 1GB และกราฟิกที่เข้ากันได้ แต่อุปกรณ์เหล่านี้อาจพบว่าประสิทธิภาพลดลง
                • ผู้เล่นหลายคน – เล่นกับเพื่อนมากถึง 7 คนบน Local Wifi หรือออนไลน์ผ่านเกมที่โฮสต์โดยอุปกรณ์-Wifi หรือผ่าน Mobile Terraria Dedicated Server สำหรับพีซี (มีให้ฟรีบน Terraria.org)
                • TERRARIA สร้างภาพใหม่สำหรับมือถือ - การควบคุมที่ปรับแต่งได้อย่างเต็มที่และส่วนต่อประสานผู้ใช้มอบระดับการขัดเกลาและความสามารถที่ไม่เคยมีมาก่อน!
                • รองรับเกมแพด – รวมถึงปุ่มที่ตั้งค่าใหม่ได้อย่างสมบูรณ์ - เล่นกับเกมแพดที่เชื่อมต่อ Bluetooth ในตำแหน่งที่รองรับ
                • ขนาดของโลกเต็มรูปแบบ – เล็ก/กลาง/ใหญ่...ขนาดเดียวกับ Terraria สำหรับพีซี! รวมโปรแกรมสร้างชื่อโลกแบบสุ่มและความสามารถในการใช้ World Seeds (รวมถึงโลกไข่อีสเตอร์ที่ซ่อนอยู่บางส่วน)
                • ศัตรูกว่า 400 ตัวให้ต่อสู้ ปราบ และปล้นสะดมเพื่อชิงของ
                • มีไบโอมและมินิไบโอมให้สำรวจกว่า 20 รายการ ทั้งด้านบนและใต้ดิน ตั้งแต่ป่าอันเขียวชอุ่มไปจนถึงทะเลทรายที่แห้งแล้ง ไปจนถึงคุกใต้ดิน นรก และแม้แต่การทุจริตที่น่าสะพรึงกลัวรอคุณอยู่!
                • อัปเดตงานหัตถกรรมด้วยตัวเลือกรายการเพิ่มหลายรายการ
                • มี NPC มากกว่า 20 ตัวให้ค้นพบ โดยแต่ละแห่งให้ประโยชน์และสไตล์ที่เป็นเอกลักษณ์ของตัวเอง
                • ตัวเลือกการสร้างในเชิงลึกที่เรียนรู้ได้ง่าย แต่ให้งานสถาปัตยกรรมอันน่าทึ่งในมือของผู้เชี่ยวชาญ
                • และอีกมากมาย!
                กล่าวโดยย่อ ทุกพิกเซลของ Terraria ได้รับการจินตนาการใหม่และสร้างขึ้นด้วยมือเพื่อประสบการณ์มือถือที่ดีที่สุด!
                ติดตามเราบน Twitter @Terraria_Logic และ @505_Games
                เข้าร่วมชุมชนของเราบน Discord @ http://Discord.GG/Terraria
                ชอบเราบน Facebook ที่ www.facebook.com/TerrariaOfficial และ https://www.facebook.com/505Games
                เยี่ยมชมเราได้ทางเว็บที่ www.terraria.org
                เข้าร่วมฟอรัม Terraria อย่างเป็นทางการได้ที่: https://forums.terraria.org/',

                'game_price' => '159',
                'game_url_video' => 'https://youtu.be/H77Zfzy4LWw?si=knSpDuOdjSOH69Lq',
                'game_img_logo' => 'img_logo/terraria.webp',
                'game_img' => 'img_background/terraria.jpg',
            ],
            [
                'game_name' => 'Mincraft',

                'game_detail' => 'Minecraft เป็นเกมที่สร้างจากบล็อกที่คุณสามารถแปลงร่างเป็นอะไรก็ได้ที่คุณจินตนาการได้ เล่นในโหมดสร้างสรรค์ด้วยทรัพยากรไม่จำกัด หรือตามล่าหาเครื่องมือเพื่อป้องกันอันตรายในโหมดเอาชีวิตรอด ด้วยการเล่นข้ามแพลตฟอร์มที่ราบรื่นบน Minecraft: Bedrock Edition คุณสามารถผจญภัยคนเดียวหรือกับเพื่อน ๆ และค้นพบโลกที่ไม่มีที่สิ้นสุดที่สร้างขึ้นแบบสุ่มซึ่งเต็มไปด้วยบล็อกให้ขุด ไบโอมให้สำรวจ และฝูงสัตว์ให้เป็นเพื่อน (หรือต่อสู้) ตัวเลือกเป็นของคุณใน Minecraft ดังนั้นเล่นในแบบของคุณ!
                    ขยายเกมของคุณ:
                    ตลาด Minecraft - ค้นพบการสร้างสรรค์ล่าสุดในชุมชนในตลาด! รับโลก สกิน และแพ็คพื้นผิวที่ไม่ซ้ำใครจากผู้สร้างคนโปรดของคุณ
                    คำสั่งสแลช - ปรับแต่งวิธีการเล่นของเกม: คุณสามารถแจกไอเทม เรียกฝูงสัตว์ เปลี่ยนเวลาของวัน และอื่นๆ อีกมากมาย
                    ส่วนเสริม - ปรับแต่งประสบการณ์ของคุณให้ดียิ่งขึ้นด้วยส่วนเสริมฟรี! หากคุณชอบเทคโนโลยีมากขึ้น คุณสามารถแก้ไขพฤติกรรมที่ขับเคลื่อนด้วยข้อมูลในเกมเพื่อสร้างชุดทรัพยากรใหม่
                    ผู้เล่นหลายคน
                    Realms และ Realms Plus - เล่นกับเพื่อนได้สูงสุด 10 คนข้ามแพลตฟอร์มทุกที่ทุกเวลาบน Realms เซิร์ฟเวอร์ส่วนตัวของคุณที่เราโฮสต์ให้คุณ ด้วย Realms Plus คุณจะได้รับสิทธิ์เข้าถึงรายการ Marketplace มากกว่า 150 รายการพร้อมการเพิ่มใหม่ในแต่ละเดือน แบ่งปันกับเพื่อน ๆ บนเซิร์ฟเวอร์ Realms ส่วนตัวของคุณเอง ลองทดลองใช้ฟรี 30 วันในแอป
                    ผู้เล่นหลายคน - เล่นกับเพื่อนสูงสุด 4 คนด้วยบัญชี Xbox Live ออนไลน์ฟรี
                    เซิร์ฟเวอร์ - เข้าร่วมเซิร์ฟเวอร์ที่มีผู้เล่นหลายคนจำนวนมากฟรีและเล่นกับเซิร์ฟเวอร์อื่นอีกนับพัน! ค้นพบโลกที่ดำเนินโดยชุมชนขนาดมหึมา แข่งขันในมินิเกมที่ไม่เหมือนใคร และสังสรรค์ในล็อบบี้ที่เต็มไปด้วยเพื่อนใหม่!
                    สนับสนุน: https://www.minecraft.net/help
                    เรียนรู้เพิ่มเติม: https://www.minecraft.net/
                    ข้อมูลจำเพาะขั้นต่ำที่แนะนำ
                    หากต้องการตรวจสอบข้อกำหนดสำหรับอุปกรณ์ของคุณ โปรดไปที่: https://help.minecraft.net/hc/en-us/articles/4409172223501',

                'game_price' => '250',
                'game_url_video' => 'https://youtu.be/qNMfF9TYETM?si=XfifyBSWEQUbXH8d',
                'game_img_logo' => 'img_logo/minecraft.webp',
                'game_img' => 'img_background/minecraft.jpg',
            ],
            [
                'game_name' => 'Stardew Valley',

                'game_detail' => '"Stardew Valley ผสมผสานการจำลองฟาร์มเข้ากับองค์ประกอบ RPG ได้อย่างสวยงาม เพื่อสร้างโลกชนบทที่น่าสนใจและน่าดึงดูด" - IGN
                “เป็นมากกว่าเกมทำฟาร์ม… เต็มไปด้วยเนื้อหาและหัวใจที่ดูเหมือนไม่มีที่สิ้นสุด” ระเบิดยักษ์
                “Stardew Valley เป็นประสบการณ์ที่เข้มข้นและอบอุ่นใจที่สุดที่ฉันเคยมีในเกมในรอบหลายปี” นิตยสาร CG',

                'game_price' => '150',
                'game_url_video' => 'https://youtu.be/j1kh8M_BjEE?si=zy_u5sCRl3gjiG9z',
                'game_img_logo' => 'img_logo/stardew-valley.png',
                'game_img' => 'img_background/Stardew-Valley.webp',
            ],
            [
                'game_name' => 'GTA San',

                'game_detail' => 'ห้าปีที่ผ่านมาคาร์ลจอห์นสันหนีออกมาจากแรงกดดันของชีวิตใน Los Santos, San Andreas เมืองฉีกตัวเองออกจากกันด้วยปัญหาแก๊งยาเสพติดและการทุจริต ที่ filmstars และเศรษฐีทำอย่างดีที่สุดเพื่อหลีกเลี่ยงการตัวแทนจำหน่ายและ gangbangers
                        ตอนนี้ก็ต้นปี 90 คาร์ลได้ที่จะกลับบ้าน แม่ของเขาได้รับการฆ่าครอบครัวของเขาได้ลดลงออกจากกันและเพื่อนในวัยเด็กของเขาทุกคนมุ่งหน้าไปทางภัยพิบัติ
                        เมื่อเขากลับไปอยู่ในย่านที่คู่ของตำรวจเสียหายกรอบเขาสำหรับการฆาตกรรม CJ ถูกบังคับในการเดินทางที่จะพาเขาไปทั่วทั้งรัฐ San Andreas เพื่อช่วยครอบครัวของเขาและจะใช้การควบคุมของถนนที่
                        Rockstar เกมส์นำที่ใหญ่ที่สุดของการเปิดตัวมือถือยังมีมากมายโลกที่เปิดกว้างครอบคลุมสถานะของ San Andreas และสามเมืองใหญ่ของ - Los Santos, San Fierro และลาสเว Venturas - ความจงรักภักดีกับภาพที่เพิ่มขึ้นและกว่า 70 ชั่วโมงของการเล่นเกม
                        ออโต้แกรนด์ขโมย: San Andreas คุณสมบัติ:
                        •กราฟิกมาสเตอร์ความละเอียดสูงที่สร้างขึ้นเฉพาะสำหรับโทรศัพท์มือถือรวมทั้งการปรับปรุงไฟ, จานสีอุดมและปรับปรุงรูปแบบตัวอักษร
                        •เมฆบันทึกการสนับสนุนสำหรับการเล่นในทุกอุปกรณ์มือถือของคุณ Rockstar สมาชิกชมรมสังคม
                        •การควบคุมแบบ dual ติดอนาล็อกสำหรับกล้องถ่ายรูปและการควบคุมการเคลื่อนไหว
                        •สามแผนการควบคุมที่แตกต่างกันและการควบคุมการปรับแต่งด้วยตัวเลือกตามบริบทเพื่อแสดงปุ่มเฉพาะเมื่อคุณต้องการให้พวกเขา
                        •สามารถใช้ร่วมกับ Moga ไร้สายควบคุมเกมและเลือกบลูทู ธ และ USB gamepads
                        •แบบบูรณาการที่มีผลกระทบแช่สัมผัส
                        •ปรับแต่งประสบการณ์ภาพของคุณด้วยการตั้งค่ากราฟิกปรับ
                        ภาษาที่รองรับ: อังกฤษ, ฝรั่งเศส, อิตาลี, เยอรมัน, สเปน, รัสเซียและญี่ปุ่น
                        เพื่อประสิทธิภาพสูงสุดเราขอแนะนำอีกครั้งบูตเครื่องของคุณหลังจากการดาวน์โหลดและปิดโปรแกรมอื่น ๆ เมื่อเล่น Grand Theft Auto: San Andreas
                        สำหรับข้อมูลเกี่ยวกับอุปกรณ์ที่สนับสนุนและเข้ากันได้โปรดดูที่:
                        http://support.rockstargames.com/hc/en-us/sections/200251868-San-Andreas-Mobile-Support
                        รุ่นมือถือที่พัฒนาโดยสตูดิโอกลองสงคราม
                        www.wardrumstudios.com
                        หาข้อมูลเพิ่มเติม:
                        www.rockstargames.com
                        ดูวิดีโอ:
                        www.youtube.com/rockstargames
                        ตามเรามา:
                        www.facebook.com/rockstargames
                        www.twitter.com/rockstargames',

                'game_price' => '159',
                'game_url_video' => 'https://youtu.be/u_CbHrBbHNQ?si=nsTCPEA-is8zmx78',
                'game_img_logo' => 'img_logo/gta.webp',
                'game_img' => 'img_background/gta.jpg',
            ],
        ]);

        DB::table('recommends')->insert([
            [
                'recom_detail' => 'Terraria is the best game.',
                'recom_img' => 'img_background/terraria.jpg',
            ],
            [
                'recom_detail' => 'Minecraft has a lot of people playing it.',
                'recom_img' => 'img_background/minecraft.jpg',
            ],
            [
                'recom_detail' => 'GTA is a fun game.',
                'recom_img' => 'img_background/gta.webp',
            ],
        ]);
    }
}
